export default {
  description: [
    {
      text: `На основе предложенного макета создать HTML страницу с тремя колонками для
элементов с текстом, олицетворяющих карточки с лексикой. Структура карточки
позволяет разместить текст заголовка и текст содержания. Карточки могут быть
разного цвета, как продемонстрировано на макете.`,
    },
    {
      text: `Предложенные к заданию данные содержат список тем, фраз на иностранном
языке и соответствующих им переводов. Требуется программным образом
наполнить колонки карточками, используя тексты на иностранном языке. Цвет, а
также тексты для заголовков и содержания выбирать случайным образом из
предложенных к заданию данных. Необходимо использовать все данные, при этом
первая колонка должна содержать от трех до пяти карточек. Необходимо
упорядочить карточки в каждой колонке по количеству слов - от большего к
меньшему.`,
    },
    {
      text: `Реализовать интерактивное (при возможности продемонстрировать
анимированное) поведение карточек:`,
      subText: `Подсветка при наведение курсора;
 Одинарное нажатие меняет текст содержания карточки на соответствующий
перевод. Обратное изменение происходит через определенный интервал
времени или при повторном нажатии;
 Двойное нажатие удаляет карточку.`,
    },
  ],
  implementation: [
    {text: 'first text'},
    {text: 'second text'},
    {text: 'third text'},
    {text: 'first text'},
    {text: 'second text'},
    {text: 'third text'},
    {text: 'first text'},
    {text: 'second text'},
    {text: 'third text'},
    {text: 'first text'},
    {text: 'second text'},
    {text: 'third text'},
  ],
};
